Pnotif_pg.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <stringProp name="TestPlan.comments">${__P(Thread, 1)}</stringProp>
        <stringProp name="ThreadGroup.num_threads">${__P(Thread, 1)}</stringProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <stringProp name="HTTPSampler.domain">npdlqpxkb7.execute-api.ap-south-1.amazonaws.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/switch2/pnotif</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;SV&quot;: &quot;nTxpZA8roUV4rmO5MfScDGhhP4HPS2ZbN56GKDQLiItGBR913Nrw6cvcwjlzb+s+dJ5So1J85HryeZRcKRmLBdzypMOrgd2AjifTH74C+7lJUVlxYRoEFq2/iWvrPc8TiY2Sf7s7K+hfWIvUM43VVj3g9FwGvfkWhsiMhjaHj+xr+hVjYk5iBaT8ENUCtRZHqzAkQdmXvKeHaqA87kgBd7xVCXcVU+qAqQtIeQGJaaLFd9DxWrUGSY4ZXL3bxIHsS/G3cHTtGOp/TsSxjEWzDeyIc/gNRh/jBe15D8PMnPEtFPbW1O2xopDZOCY5I4GuozIF7ZCLT49CoJlLQM2jVQ==&quot;,&#xd;
    &quot;SK&quot;: &quot;Zp+IhKtT4EuhGDQdjV7Z3u+y+zrHjnhq2xXHkPSLO+CwiPFFA32euIe5FnksZ/KB915+QP0YX8PwPv2gDQz0SAAYFyV5lhw/J+Lm+/P+GS9jtzERAThmHJiFvE6lUFKrZApkJRy9HDzjZCbKwHid46cO0AUfyArb91wm7ouSW6K6D4UQEl3eKgC7btaWsSsr/SPMMD3KY0B/n9Sa67e2BuFw9sKBMRuvcRS/t0FeubCs1xsOJr5+aVMdoWBhUJp2uRapAxhhgSANpRfAiS98ebUO9ym6UFVBKTARnqFrDMK373nUO4lBcp+5TrIESCsV5p4wLPjxbVHQHp0IQ0Sysw==&quot;,&#xd;
    &quot;Payload&quot;: &quot;nVQWfartOt9f5DapoQzs8TYVo9dOI444UYAi1wdbWUiZEdxcSgYqnPVyZbqFSkW1/3GuOremt8Wn2HDHN76PueLKsN0jilQrAK8mybw6YxqtUOnTeMk0YJhFjuGrTDnmOfGHsaHrnldwGGDz26GXQ/4tLCZCD+2Ap0zoRrIZ3kUiPHBcp4abPrDSNufxp/VWCjKSFXKTAIw5gBQDKbYxdVlJRRtAv2buW5IDWWkWV+dhoulZo9lsNwVoO/et+Wg2&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">context</stringProp>
                <stringProp name="Header.value">janabank</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>